.svn/pristine/1d/1d026573d31e7df3f06ab0eec5ce7d28395ee0e7.svn-base

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl" xmlns:typ="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl/types/">
    <x:Header/>
    <x:Body>
        <web:issuePolicy>
            <web:pUserId>___insurer_integration_service_user___</web:pUserId>
            <web:pPassword>___insurer_integration_service_password___</web:pPassword>
            <web:pTransactionId>___dbmaster_insurer_transaction_identifier___</web:pTransactionId>
            <web:pRcptList_inout>
                <typ:WeoTyacPayRowWsUser>
                    <typ:payMode></typ:payMode>
                    <typ:receiptNo/>
                    <typ:payAmt></typ:payAmt>
                    <typ:collectionNo/>
                    <typ:collectionAmt></typ:collectionAmt>
                </typ:WeoTyacPayRowWsUser>
            </web:pRcptList_inout>
            <web:pCustDetails_inout>
                <typ:telephone1/>
                <typ:dateOfBirth>___birth_date___</typ:dateOfBirth>
                <typ:telephone2/>
                <typ:status1/>
                <typ:institutionName></typ:institutionName>
                <typ:profession></typ:profession>
                <typ:existingYn></typ:existingYn>
                <typ:addLine3>___communication_city___</typ:addLine3>
                <typ:surname>___last_name___</typ:surname>
                <typ:addLine2>___communication_address_2___</typ:addLine2>
                <typ:partId></typ:partId>
                <typ:addLine1>___communication_address_1___</typ:addLine1>
                <typ:password/>
                <typ:title>___salutation___</typ:title>
                <typ:delivaryOption/>
                <typ:firstName>___first_name___</typ:firstName>
                <typ:middleName>___middle_name___</typ:middleName>
                <typ:mobileAlerts/>
                <typ:loggedIn/>
                <typ:partTempId></typ:partTempId>
                <typ:availableTime/>
                <typ:pincode>___communication_pincode___</typ:pincode>
                <typ:polAddLine1>___communication_address_1___</typ:polAddLine1>
                <typ:polAddLine3>___communication_city___</typ:polAddLine3>
                <typ:polAddLine2>___communication_address_2___,___communication_address_3___</typ:polAddLine2>
                <typ:addLine5>___communication_state___</typ:addLine5>
                <typ:polAddLine5>___communication_state___</typ:polAddLine5>
                <typ:polPincode>___communication_pincode___</typ:polPincode>
                <typ:cpType>P</typ:cpType>
                <typ:email>___email___</typ:email>
                <typ:status3/>
                <typ:status2/>
                <typ:emailAlerts/>
                <typ:mobile>___mobile___</typ:mobile>
            </web:pCustDetails_inout>
            <web:pWeoMotPolicyIn_inout>
                <typ:vehicleTypeCode>___product_id___</typ:vehicleTypeCode>
                <typ:vehicleSubtype>___dbmaster_insurer_vehicle_variant_name___</typ:vehicleSubtype>
                <typ:elecAccTotal>___electrical_accessory___</typ:elecAccTotal>
                <typ:addLoadingOn></typ:addLoadingOn>
                <typ:nonElecAccTotal>___non_electrical_accessory___</typ:nonElecAccTotal>
                <typ:polType>___vehicle_insurance_type___</typ:polType>
                <typ:registrationNo>___registration_no___</typ:registrationNo>
                <typ:partnerType>___vehicle_registration_type___</typ:partnerType>
                <typ:ncb>___vehicle_ncb_next___</typ:ncb>
                <typ:prvClaimStatus>___is_claim_exists___</typ:prvClaimStatus>
                <typ:registrationDate>___vehicle_registration_date___</typ:registrationDate>
                <typ:miscVehType>0</typ:miscVehType>
                <typ:fuel>___dbmaster_insurer_vehicle_fueltype___</typ:fuel>
                <typ:chassisNo>___chassis_number___</typ:chassisNo>
                <typ:engineNo>___engine_number___</typ:engineNo>
                <typ:contractId>0</typ:contractId>
                <typ:yearManf>___vehicle_manf_year___</typ:yearManf>
                <typ:spDiscRate>0</typ:spDiscRate>
                <typ:cubicCapacity>___dbmaster_insurer_vehicle_cubiccapacity___</typ:cubicCapacity>
                <typ:regiLocOther>___dbmaster_insurer_rto_city_name___</typ:regiLocOther>
                <typ:addLoading>0</typ:addLoading>
                <typ:vehicleSubtypeCode>___dbmaster_insurer_vehicle_variant_code___</typ:vehicleSubtypeCode>
                <typ:prvPolicyRef>0</typ:prvPolicyRef>
                <typ:vehicleMake>___dbmaster_insurer_vehicle_make_name___</typ:vehicleMake>
                <typ:autoMembership/>
                <typ:termStartDate>___policy_start_date___</typ:termStartDate>
                <typ:carryingCapacity>___dbmaster_insurer_vehicle_seatingcapacity___</typ:carryingCapacity>
                <typ:termEndDate>___policy_end_date___</typ:termEndDate>
                <typ:hypo>___financial_institute_name___</typ:hypo>
                <typ:branchCode>___insurer_integration_location_code___</typ:branchCode>
                <typ:prvNcb>___vehicle_ncb_current___</typ:prvNcb>
                <typ:vehicleMakeCode>___dbmaster_insurer_vehicle_make_code___</typ:vehicleMakeCode>
                <typ:vehicleIdv></typ:vehicleIdv>
                <typ:prvInsCompany>___dbmaster_previousinsurer_code___</typ:prvInsCompany>
                <typ:product4digitCode>___vehicle_insurance_subtype_4___</typ:product4digitCode>
                <typ:color></typ:color>
                <typ:vehicleModel>___dbmaster_insurer_vehicle_model_name___</typ:vehicleModel>
                <typ:vehicleType>___product_id_3___</typ:vehicleType>
                <typ:prvExpiryDate>___policy_expiry_date___</typ:prvExpiryDate>
                <typ:tpFinType>1</typ:tpFinType>
                <typ:deptCode>18</typ:deptCode>
                <typ:vehicleModelCode>___dbmaster_insurer_vehicle_model_code___</typ:vehicleModelCode>
                <typ:registrationLocation>___dbmaster_insurer_rto_city_name___</typ:registrationLocation>
                <typ:zone>___dbmaster_insurer_rto_zone_code___</typ:zone>
            </web:pWeoMotPolicyIn_inout>
            <web:accessoriesList>
                <typ:WeoMotAccessoriesUser>
                    <typ:accModel>0</typ:accModel>
                    <typ:accTypeCode>0</typ:accTypeCode>
                    <typ:accCategoryCode>0</typ:accCategoryCode>
                    <typ:accCount>0</typ:accCount>
                    <typ:contractId>0</typ:contractId>
                    <typ:accIev>0</typ:accIev>
                    <typ:accMake>0</typ:accMake>
                </typ:WeoMotAccessoriesUser>
            </web:accessoriesList>
            <web:paddoncoverList>
                <typ:WeoMotGenParamUser>
                    <typ:paramDesc></typ:paramDesc>
                    <typ:paramRef></typ:paramRef>
                </typ:WeoMotGenParamUser>
            </web:paddoncoverList>
            <web:motExtraCover_inout>
                <typ:sideCarValue/>
                <typ:covernoteNo/>
                <typ:noOfTrailers/>
                <typ:subImdcode></typ:subImdcode>
                <typ:covernoteDate/>
                <typ:cngValue></typ:cngValue>
                <typ:fibreGlassValue/>
                <typ:voluntaryExcess/>
                <typ:totalTrailerValue/>
                <typ:extraField1>___communication_pincode___</typ:extraField1>
                <typ:sumInsuredTotalNamedPa/>
                <typ:geogExtn/>
                <typ:noOfPersonsLlo></typ:noOfPersonsLlo>
                <typ:noOfEmployeesLle/>
                <typ:extraField2/>
                <typ:extraField3/>
                <typ:sumInsuredPa></typ:sumInsuredPa>
                <typ:noOfPersonsPa></typ:noOfPersonsPa>
            </web:motExtraCover_inout>
            <web:premiumDetails>
                <typ:serviceTax/>
                <typ:collPremium/>
                <typ:totalActPremium/>
                <typ:netPremium/>
                <typ:totalIev/>
                <typ:addLoadPrem/>
                <typ:totalNetPremium/>
                <typ:imtOut/>
                <typ:totalPremium/>
                <typ:ncbAmt/>
                <typ:stampDuty/>
                <typ:totalOdPremium/>
                <typ:spDisc/>
                <typ:finalPremium/>
            </web:premiumDetails>
            <web:premiumSummeryList>
                <typ:WeoMotPremiumSummaryUser>
                    <typ:od/>
                    <typ:paramDesc/>
                    <typ:paramRef/>
                    <typ:net/>
                    <typ:act/>
                    <typ:paramType/>
                </typ:WeoMotPremiumSummaryUser>
            </web:premiumSummeryList>
            <web:pQuestList>
                <typ:WeoBjazMotQuestionaryUser>
                    <typ:questionRef/>
                    <typ:contractId/>
                    <typ:questionVal/>
                </typ:WeoBjazMotQuestionaryUser>
            </web:pQuestList>
            <web:ppolicyref_out></web:ppolicyref_out>
            <web:ppolicyissuedate_out></web:ppolicyissuedate_out>
            <web:ppartId_out></web:ppartId_out>
            <web:pError_out>
                <typ:WeoTygeErrorMessageUser>
                    <typ:errNumber/>
                    <typ:parName/>
                    <typ:property/>
                    <typ:errText/>
                    <typ:parIndex/>
                    <typ:errLevel/>
                </typ:WeoTygeErrorMessageUser>
            </web:pError_out>
            <web:pErrorCode_out></web:pErrorCode_out>
            <web:ppremiumpayerid></web:ppremiumpayerid>
            <web:paymentmode>CC</web:paymentmode>
            <web:potherdetails>
                <typ:covernoteNo/>
                <typ:cceCode/>
                <typ:extra1></typ:extra1>
                <typ:extra2/>
                <typ:imdcode/>
                <typ:extra3/>
                <typ:extra4/>
                <typ:extra5/>
                <typ:leadNo/>
                <typ:runnerCode/>
            </web:potherdetails>
            <web:pMotDetariff>
                <typ:driverQualificationCode/>
                <typ:vehPurchaseType/>
                <typ:extCol25/>
                <typ:extCol26/>
                <typ:tacMakeCode/>
                <typ:extCol23/>
                <typ:extCol24/>
                <typ:extCol29/>
                <typ:extCol27/>
                <typ:extCol28/>
                <typ:extCol33/>
                <typ:extCol32/>
                <typ:extCol31/>
                <typ:extCol30/>
                <typ:registrationAuth/>
                <typ:extCol12/>
                <typ:extCol13/>
                <typ:extCol14/>
                <typ:extCol15/>
                <typ:extCol16/>
                <typ:extCol17></typ:extCol17>
                <typ:extCol18/>
                <typ:extCol19/>
                <typ:otherGoodsFrequency/>
                <typ:extCol20></typ:extCol20>
                <typ:extCol22/>
                <typ:incurredClmExpCode/>
                <typ:extCol21/>
                <typ:clmHistCode/>
                <typ:roadType/>
                <typ:bodyType/>
                <typ:monthOfMfg></typ:monthOfMfg>
                <typ:natureOfGoods/>
                <typ:extCol9/>
                <typ:extCol8/>
                <typ:extCol7></typ:extCol7>
                <typ:extCol6/>
                <typ:vehPurchaseDate/>
                <typ:extCol5/>
                <typ:extCol4/>
                <typ:vehDrivenBy/>
                <typ:extCol3></typ:extCol3>
                <typ:extCol2/>
                <typ:extCol1/>
                <typ:goodsTransType/>
                <typ:permitType/>
                <typ:extCol38/>
                <typ:extCol39/>
                <typ:extCol34/>
                <typ:extCol35/>
                <typ:extCol36/>
                <typ:extCol10></typ:extCol10>
                <typ:extCol37/>
                <typ:extCol11/>
                <typ:extCol40/>
                <typ:driverExperience/>
            </web:pMotDetariff>
        </web:issuePolicy>
    </x:Body>
</x:Envelope>
